Model: "frank_AlexNet"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 32, 32, 3)]       0         
_________________________________________________________________
rescaling (Rescaling)        (None, 32, 32, 3)         0         
_________________________________________________________________
resizing (Resizing)          (None, 27, 27, 3)         0         
_________________________________________________________________
conv2d (Conv2D)              (None, 14, 14, 256)       19456     
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 6, 6, 256)         0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 6, 6, 384)         885120    
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 6, 6, 384)         1327488   
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 6, 6, 256)         884992    
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 2, 2, 256)         0         
_________________________________________________________________
flatten (Flatten)            (None, 1024)              0         
_________________________________________________________________
dense (Dense)                (None, 4096)              4198400   
_________________________________________________________________
dropout (Dropout)            (None, 4096)              0         
_________________________________________________________________
dense_1 (Dense)              (None, 4096)              16781312  
_________________________________________________________________
dropout_1 (Dropout)          (None, 4096)              0         
_________________________________________________________________
dense_2 (Dense)              (None, 1000)              4097000   
_________________________________________________________________
dropout_2 (Dropout)          (None, 1000)              0         
_________________________________________________________________
dense_3 (Dense)              (None, 10)                10010     
=================================================================
Total params: 28,203,778
Trainable params: 28,203,778
Non-trainable params: 0
_________________________________________________________________
