Model: "frank_Inception"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 32, 32, 3)]  0                                            
__________________________________________________________________________________________________
rescaling (Rescaling)           (None, 32, 32, 3)    0           input_1[0][0]                    
__________________________________________________________________________________________________
resizing (Resizing)             (None, 227, 227, 3)  0           rescaling[0][0]                  
__________________________________________________________________________________________________
conv2d (Conv2D)                 (None, 111, 111, 64) 9472        resizing[0][0]                   
__________________________________________________________________________________________________
max_pooling2d (MaxPooling2D)    (None, 56, 56, 64)   0           conv2d[0][0]                     
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 56, 56, 192)  110784      max_pooling2d[0][0]              
__________________________________________________________________________________________________
max_pooling2d_1 (MaxPooling2D)  (None, 28, 28, 192)  0           conv2d_1[0][0]                   
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 28, 28, 96)   18528       max_pooling2d_1[0][0]            
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (None, 28, 28, 16)   3088        max_pooling2d_1[0][0]            
__________________________________________________________________________________________________
max_pooling2d_2 (MaxPooling2D)  (None, 28, 28, 192)  0           max_pooling2d_1[0][0]            
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 28, 28, 64)   12352       max_pooling2d_1[0][0]            
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, 28, 28, 128)  110720      conv2d_3[0][0]                   
__________________________________________________________________________________________________
conv2d_6 (Conv2D)               (None, 28, 28, 32)   12832       conv2d_5[0][0]                   
__________________________________________________________________________________________________
conv2d_7 (Conv2D)               (None, 28, 28, 32)   6176        max_pooling2d_2[0][0]            
__________________________________________________________________________________________________
concatenate (Concatenate)       (None, 28, 28, 256)  0           conv2d_2[0][0]                   
                                                                 conv2d_4[0][0]                   
                                                                 conv2d_6[0][0]                   
                                                                 conv2d_7[0][0]                   
__________________________________________________________________________________________________
conv2d_9 (Conv2D)               (None, 28, 28, 128)  32896       concatenate[0][0]                
__________________________________________________________________________________________________
conv2d_11 (Conv2D)              (None, 28, 28, 32)   8224        concatenate[0][0]                
__________________________________________________________________________________________________
max_pooling2d_3 (MaxPooling2D)  (None, 28, 28, 256)  0           concatenate[0][0]                
__________________________________________________________________________________________________
conv2d_8 (Conv2D)               (None, 28, 28, 128)  32896       concatenate[0][0]                
__________________________________________________________________________________________________
conv2d_10 (Conv2D)              (None, 28, 28, 192)  221376      conv2d_9[0][0]                   
__________________________________________________________________________________________________
conv2d_12 (Conv2D)              (None, 28, 28, 96)   76896       conv2d_11[0][0]                  
__________________________________________________________________________________________________
conv2d_13 (Conv2D)              (None, 28, 28, 64)   16448       max_pooling2d_3[0][0]            
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 28, 28, 480)  0           conv2d_8[0][0]                   
                                                                 conv2d_10[0][0]                  
                                                                 conv2d_12[0][0]                  
                                                                 conv2d_13[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_4 (MaxPooling2D)  (None, 14, 14, 480)  0           concatenate_1[0][0]              
__________________________________________________________________________________________________
conv2d_15 (Conv2D)              (None, 14, 14, 96)   46176       max_pooling2d_4[0][0]            
__________________________________________________________________________________________________
conv2d_17 (Conv2D)              (None, 14, 14, 16)   7696        max_pooling2d_4[0][0]            
__________________________________________________________________________________________________
max_pooling2d_5 (MaxPooling2D)  (None, 14, 14, 480)  0           max_pooling2d_4[0][0]            
__________________________________________________________________________________________________
conv2d_14 (Conv2D)              (None, 14, 14, 192)  92352       max_pooling2d_4[0][0]            
__________________________________________________________________________________________________
conv2d_16 (Conv2D)              (None, 14, 14, 208)  179920      conv2d_15[0][0]                  
__________________________________________________________________________________________________
conv2d_18 (Conv2D)              (None, 14, 14, 48)   19248       conv2d_17[0][0]                  
__________________________________________________________________________________________________
conv2d_19 (Conv2D)              (None, 14, 14, 64)   30784       max_pooling2d_5[0][0]            
__________________________________________________________________________________________________
concatenate_2 (Concatenate)     (None, 14, 14, 512)  0           conv2d_14[0][0]                  
                                                                 conv2d_16[0][0]                  
                                                                 conv2d_18[0][0]                  
                                                                 conv2d_19[0][0]                  
__________________________________________________________________________________________________
conv2d_21 (Conv2D)              (None, 14, 14, 112)  57456       concatenate_2[0][0]              
__________________________________________________________________________________________________
conv2d_23 (Conv2D)              (None, 14, 14, 24)   12312       concatenate_2[0][0]              
__________________________________________________________________________________________________
max_pooling2d_6 (MaxPooling2D)  (None, 14, 14, 512)  0           concatenate_2[0][0]              
__________________________________________________________________________________________________
conv2d_20 (Conv2D)              (None, 14, 14, 160)  82080       concatenate_2[0][0]              
__________________________________________________________________________________________________
conv2d_22 (Conv2D)              (None, 14, 14, 224)  226016      conv2d_21[0][0]                  
__________________________________________________________________________________________________
conv2d_24 (Conv2D)              (None, 14, 14, 64)   38464       conv2d_23[0][0]                  
__________________________________________________________________________________________________
conv2d_25 (Conv2D)              (None, 14, 14, 64)   32832       max_pooling2d_6[0][0]            
__________________________________________________________________________________________________
concatenate_3 (Concatenate)     (None, 14, 14, 512)  0           conv2d_20[0][0]                  
                                                                 conv2d_22[0][0]                  
                                                                 conv2d_24[0][0]                  
                                                                 conv2d_25[0][0]                  
__________________________________________________________________________________________________
conv2d_27 (Conv2D)              (None, 14, 14, 128)  65664       concatenate_3[0][0]              
__________________________________________________________________________________________________
conv2d_29 (Conv2D)              (None, 14, 14, 24)   12312       concatenate_3[0][0]              
__________________________________________________________________________________________________
max_pooling2d_7 (MaxPooling2D)  (None, 14, 14, 512)  0           concatenate_3[0][0]              
__________________________________________________________________________________________________
conv2d_26 (Conv2D)              (None, 14, 14, 128)  65664       concatenate_3[0][0]              
__________________________________________________________________________________________________
conv2d_28 (Conv2D)              (None, 14, 14, 256)  295168      conv2d_27[0][0]                  
__________________________________________________________________________________________________
conv2d_30 (Conv2D)              (None, 14, 14, 64)   38464       conv2d_29[0][0]                  
__________________________________________________________________________________________________
conv2d_31 (Conv2D)              (None, 14, 14, 64)   32832       max_pooling2d_7[0][0]            
__________________________________________________________________________________________________
concatenate_4 (Concatenate)     (None, 14, 14, 512)  0           conv2d_26[0][0]                  
                                                                 conv2d_28[0][0]                  
                                                                 conv2d_30[0][0]                  
                                                                 conv2d_31[0][0]                  
__________________________________________________________________________________________________
conv2d_33 (Conv2D)              (None, 14, 14, 144)  73872       concatenate_4[0][0]              
__________________________________________________________________________________________________
conv2d_35 (Conv2D)              (None, 14, 14, 32)   16416       concatenate_4[0][0]              
__________________________________________________________________________________________________
max_pooling2d_8 (MaxPooling2D)  (None, 14, 14, 512)  0           concatenate_4[0][0]              
__________________________________________________________________________________________________
conv2d_32 (Conv2D)              (None, 14, 14, 112)  57456       concatenate_4[0][0]              
__________________________________________________________________________________________________
conv2d_34 (Conv2D)              (None, 14, 14, 288)  373536      conv2d_33[0][0]                  
__________________________________________________________________________________________________
conv2d_36 (Conv2D)              (None, 14, 14, 64)   51264       conv2d_35[0][0]                  
__________________________________________________________________________________________________
conv2d_37 (Conv2D)              (None, 14, 14, 64)   32832       max_pooling2d_8[0][0]            
__________________________________________________________________________________________________
concatenate_5 (Concatenate)     (None, 14, 14, 528)  0           conv2d_32[0][0]                  
                                                                 conv2d_34[0][0]                  
                                                                 conv2d_36[0][0]                  
                                                                 conv2d_37[0][0]                  
__________________________________________________________________________________________________
conv2d_39 (Conv2D)              (None, 14, 14, 160)  84640       concatenate_5[0][0]              
__________________________________________________________________________________________________
conv2d_41 (Conv2D)              (None, 14, 14, 32)   16928       concatenate_5[0][0]              
__________________________________________________________________________________________________
max_pooling2d_9 (MaxPooling2D)  (None, 14, 14, 528)  0           concatenate_5[0][0]              
__________________________________________________________________________________________________
conv2d_38 (Conv2D)              (None, 14, 14, 256)  135424      concatenate_5[0][0]              
__________________________________________________________________________________________________
conv2d_40 (Conv2D)              (None, 14, 14, 320)  461120      conv2d_39[0][0]                  
__________________________________________________________________________________________________
conv2d_42 (Conv2D)              (None, 14, 14, 128)  102528      conv2d_41[0][0]                  
__________________________________________________________________________________________________
conv2d_43 (Conv2D)              (None, 14, 14, 128)  67712       max_pooling2d_9[0][0]            
__________________________________________________________________________________________________
concatenate_6 (Concatenate)     (None, 14, 14, 832)  0           conv2d_38[0][0]                  
                                                                 conv2d_40[0][0]                  
                                                                 conv2d_42[0][0]                  
                                                                 conv2d_43[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_10 (MaxPooling2D) (None, 7, 7, 832)    0           concatenate_6[0][0]              
__________________________________________________________________________________________________
conv2d_45 (Conv2D)              (None, 7, 7, 160)    133280      max_pooling2d_10[0][0]           
__________________________________________________________________________________________________
conv2d_47 (Conv2D)              (None, 7, 7, 32)     26656       max_pooling2d_10[0][0]           
__________________________________________________________________________________________________
max_pooling2d_11 (MaxPooling2D) (None, 7, 7, 832)    0           max_pooling2d_10[0][0]           
__________________________________________________________________________________________________
conv2d_44 (Conv2D)              (None, 7, 7, 256)    213248      max_pooling2d_10[0][0]           
__________________________________________________________________________________________________
conv2d_46 (Conv2D)              (None, 7, 7, 320)    461120      conv2d_45[0][0]                  
__________________________________________________________________________________________________
conv2d_48 (Conv2D)              (None, 7, 7, 128)    102528      conv2d_47[0][0]                  
__________________________________________________________________________________________________
conv2d_49 (Conv2D)              (None, 7, 7, 128)    106624      max_pooling2d_11[0][0]           
__________________________________________________________________________________________________
concatenate_7 (Concatenate)     (None, 7, 7, 832)    0           conv2d_44[0][0]                  
                                                                 conv2d_46[0][0]                  
                                                                 conv2d_48[0][0]                  
                                                                 conv2d_49[0][0]                  
__________________________________________________________________________________________________
conv2d_51 (Conv2D)              (None, 7, 7, 192)    159936      concatenate_7[0][0]              
__________________________________________________________________________________________________
conv2d_53 (Conv2D)              (None, 7, 7, 48)     39984       concatenate_7[0][0]              
__________________________________________________________________________________________________
max_pooling2d_12 (MaxPooling2D) (None, 7, 7, 832)    0           concatenate_7[0][0]              
__________________________________________________________________________________________________
conv2d_50 (Conv2D)              (None, 7, 7, 384)    319872      concatenate_7[0][0]              
__________________________________________________________________________________________________
conv2d_52 (Conv2D)              (None, 7, 7, 384)    663936      conv2d_51[0][0]                  
__________________________________________________________________________________________________
conv2d_54 (Conv2D)              (None, 7, 7, 128)    153728      conv2d_53[0][0]                  
__________________________________________________________________________________________________
conv2d_55 (Conv2D)              (None, 7, 7, 128)    106624      max_pooling2d_12[0][0]           
__________________________________________________________________________________________________
concatenate_8 (Concatenate)     (None, 7, 7, 1024)   0           conv2d_50[0][0]                  
                                                                 conv2d_52[0][0]                  
                                                                 conv2d_54[0][0]                  
                                                                 conv2d_55[0][0]                  
__________________________________________________________________________________________________
global_average_pooling2d (Globa (None, 1024)         0           concatenate_8[0][0]              
__________________________________________________________________________________________________
dropout (Dropout)               (None, 1024)         0           global_average_pooling2d[0][0]   
__________________________________________________________________________________________________
dense (Dense)                   (None, 10)           10250       dropout[0][0]                    
==================================================================================================
Total params: 5,979,642
Trainable params: 5,979,642
Non-trainable params: 0
__________________________________________________________________________________________________
