Model: "frank_Inception"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_2 (InputLayer)            [(None, 227, 227, 3) 0                                            
__________________________________________________________________________________________________
rescaling_1 (Rescaling)         (None, 227, 227, 3)  0           input_2[0][0]                    
__________________________________________________________________________________________________
conv2d_56 (Conv2D)              (None, 111, 111, 64) 9472        rescaling_1[0][0]                
__________________________________________________________________________________________________
max_pooling2d_13 (MaxPooling2D) (None, 56, 56, 64)   0           conv2d_56[0][0]                  
__________________________________________________________________________________________________
conv2d_57 (Conv2D)              (None, 56, 56, 192)  110784      max_pooling2d_13[0][0]           
__________________________________________________________________________________________________
max_pooling2d_14 (MaxPooling2D) (None, 28, 28, 192)  0           conv2d_57[0][0]                  
__________________________________________________________________________________________________
conv2d_59 (Conv2D)              (None, 28, 28, 96)   18528       max_pooling2d_14[0][0]           
__________________________________________________________________________________________________
conv2d_61 (Conv2D)              (None, 28, 28, 16)   3088        max_pooling2d_14[0][0]           
__________________________________________________________________________________________________
max_pooling2d_15 (MaxPooling2D) (None, 28, 28, 192)  0           max_pooling2d_14[0][0]           
__________________________________________________________________________________________________
conv2d_58 (Conv2D)              (None, 28, 28, 64)   12352       max_pooling2d_14[0][0]           
__________________________________________________________________________________________________
conv2d_60 (Conv2D)              (None, 28, 28, 128)  110720      conv2d_59[0][0]                  
__________________________________________________________________________________________________
conv2d_62 (Conv2D)              (None, 28, 28, 32)   12832       conv2d_61[0][0]                  
__________________________________________________________________________________________________
conv2d_63 (Conv2D)              (None, 28, 28, 32)   6176        max_pooling2d_15[0][0]           
__________________________________________________________________________________________________
concatenate_9 (Concatenate)     (None, 28, 28, 256)  0           conv2d_58[0][0]                  
                                                                 conv2d_60[0][0]                  
                                                                 conv2d_62[0][0]                  
                                                                 conv2d_63[0][0]                  
__________________________________________________________________________________________________
conv2d_65 (Conv2D)              (None, 28, 28, 128)  32896       concatenate_9[0][0]              
__________________________________________________________________________________________________
conv2d_67 (Conv2D)              (None, 28, 28, 32)   8224        concatenate_9[0][0]              
__________________________________________________________________________________________________
max_pooling2d_16 (MaxPooling2D) (None, 28, 28, 256)  0           concatenate_9[0][0]              
__________________________________________________________________________________________________
conv2d_64 (Conv2D)              (None, 28, 28, 128)  32896       concatenate_9[0][0]              
__________________________________________________________________________________________________
conv2d_66 (Conv2D)              (None, 28, 28, 192)  221376      conv2d_65[0][0]                  
__________________________________________________________________________________________________
conv2d_68 (Conv2D)              (None, 28, 28, 96)   76896       conv2d_67[0][0]                  
__________________________________________________________________________________________________
conv2d_69 (Conv2D)              (None, 28, 28, 64)   16448       max_pooling2d_16[0][0]           
__________________________________________________________________________________________________
concatenate_10 (Concatenate)    (None, 28, 28, 480)  0           conv2d_64[0][0]                  
                                                                 conv2d_66[0][0]                  
                                                                 conv2d_68[0][0]                  
                                                                 conv2d_69[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_17 (MaxPooling2D) (None, 14, 14, 480)  0           concatenate_10[0][0]             
__________________________________________________________________________________________________
conv2d_71 (Conv2D)              (None, 14, 14, 96)   46176       max_pooling2d_17[0][0]           
__________________________________________________________________________________________________
conv2d_73 (Conv2D)              (None, 14, 14, 16)   7696        max_pooling2d_17[0][0]           
__________________________________________________________________________________________________
max_pooling2d_18 (MaxPooling2D) (None, 14, 14, 480)  0           max_pooling2d_17[0][0]           
__________________________________________________________________________________________________
conv2d_70 (Conv2D)              (None, 14, 14, 192)  92352       max_pooling2d_17[0][0]           
__________________________________________________________________________________________________
conv2d_72 (Conv2D)              (None, 14, 14, 208)  179920      conv2d_71[0][0]                  
__________________________________________________________________________________________________
conv2d_74 (Conv2D)              (None, 14, 14, 48)   19248       conv2d_73[0][0]                  
__________________________________________________________________________________________________
conv2d_75 (Conv2D)              (None, 14, 14, 64)   30784       max_pooling2d_18[0][0]           
__________________________________________________________________________________________________
concatenate_11 (Concatenate)    (None, 14, 14, 512)  0           conv2d_70[0][0]                  
                                                                 conv2d_72[0][0]                  
                                                                 conv2d_74[0][0]                  
                                                                 conv2d_75[0][0]                  
__________________________________________________________________________________________________
conv2d_77 (Conv2D)              (None, 14, 14, 112)  57456       concatenate_11[0][0]             
__________________________________________________________________________________________________
conv2d_79 (Conv2D)              (None, 14, 14, 24)   12312       concatenate_11[0][0]             
__________________________________________________________________________________________________
max_pooling2d_19 (MaxPooling2D) (None, 14, 14, 512)  0           concatenate_11[0][0]             
__________________________________________________________________________________________________
conv2d_76 (Conv2D)              (None, 14, 14, 160)  82080       concatenate_11[0][0]             
__________________________________________________________________________________________________
conv2d_78 (Conv2D)              (None, 14, 14, 224)  226016      conv2d_77[0][0]                  
__________________________________________________________________________________________________
conv2d_80 (Conv2D)              (None, 14, 14, 64)   38464       conv2d_79[0][0]                  
__________________________________________________________________________________________________
conv2d_81 (Conv2D)              (None, 14, 14, 64)   32832       max_pooling2d_19[0][0]           
__________________________________________________________________________________________________
concatenate_12 (Concatenate)    (None, 14, 14, 512)  0           conv2d_76[0][0]                  
                                                                 conv2d_78[0][0]                  
                                                                 conv2d_80[0][0]                  
                                                                 conv2d_81[0][0]                  
__________________________________________________________________________________________________
conv2d_83 (Conv2D)              (None, 14, 14, 128)  65664       concatenate_12[0][0]             
__________________________________________________________________________________________________
conv2d_85 (Conv2D)              (None, 14, 14, 24)   12312       concatenate_12[0][0]             
__________________________________________________________________________________________________
max_pooling2d_20 (MaxPooling2D) (None, 14, 14, 512)  0           concatenate_12[0][0]             
__________________________________________________________________________________________________
conv2d_82 (Conv2D)              (None, 14, 14, 128)  65664       concatenate_12[0][0]             
__________________________________________________________________________________________________
conv2d_84 (Conv2D)              (None, 14, 14, 256)  295168      conv2d_83[0][0]                  
__________________________________________________________________________________________________
conv2d_86 (Conv2D)              (None, 14, 14, 64)   38464       conv2d_85[0][0]                  
__________________________________________________________________________________________________
conv2d_87 (Conv2D)              (None, 14, 14, 64)   32832       max_pooling2d_20[0][0]           
__________________________________________________________________________________________________
concatenate_13 (Concatenate)    (None, 14, 14, 512)  0           conv2d_82[0][0]                  
                                                                 conv2d_84[0][0]                  
                                                                 conv2d_86[0][0]                  
                                                                 conv2d_87[0][0]                  
__________________________________________________________________________________________________
conv2d_89 (Conv2D)              (None, 14, 14, 144)  73872       concatenate_13[0][0]             
__________________________________________________________________________________________________
conv2d_91 (Conv2D)              (None, 14, 14, 32)   16416       concatenate_13[0][0]             
__________________________________________________________________________________________________
max_pooling2d_21 (MaxPooling2D) (None, 14, 14, 512)  0           concatenate_13[0][0]             
__________________________________________________________________________________________________
conv2d_88 (Conv2D)              (None, 14, 14, 112)  57456       concatenate_13[0][0]             
__________________________________________________________________________________________________
conv2d_90 (Conv2D)              (None, 14, 14, 288)  373536      conv2d_89[0][0]                  
__________________________________________________________________________________________________
conv2d_92 (Conv2D)              (None, 14, 14, 64)   51264       conv2d_91[0][0]                  
__________________________________________________________________________________________________
conv2d_93 (Conv2D)              (None, 14, 14, 64)   32832       max_pooling2d_21[0][0]           
__________________________________________________________________________________________________
concatenate_14 (Concatenate)    (None, 14, 14, 528)  0           conv2d_88[0][0]                  
                                                                 conv2d_90[0][0]                  
                                                                 conv2d_92[0][0]                  
                                                                 conv2d_93[0][0]                  
__________________________________________________________________________________________________
conv2d_95 (Conv2D)              (None, 14, 14, 160)  84640       concatenate_14[0][0]             
__________________________________________________________________________________________________
conv2d_97 (Conv2D)              (None, 14, 14, 32)   16928       concatenate_14[0][0]             
__________________________________________________________________________________________________
max_pooling2d_22 (MaxPooling2D) (None, 14, 14, 528)  0           concatenate_14[0][0]             
__________________________________________________________________________________________________
conv2d_94 (Conv2D)              (None, 14, 14, 256)  135424      concatenate_14[0][0]             
__________________________________________________________________________________________________
conv2d_96 (Conv2D)              (None, 14, 14, 320)  461120      conv2d_95[0][0]                  
__________________________________________________________________________________________________
conv2d_98 (Conv2D)              (None, 14, 14, 128)  102528      conv2d_97[0][0]                  
__________________________________________________________________________________________________
conv2d_99 (Conv2D)              (None, 14, 14, 128)  67712       max_pooling2d_22[0][0]           
__________________________________________________________________________________________________
concatenate_15 (Concatenate)    (None, 14, 14, 832)  0           conv2d_94[0][0]                  
                                                                 conv2d_96[0][0]                  
                                                                 conv2d_98[0][0]                  
                                                                 conv2d_99[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_23 (MaxPooling2D) (None, 7, 7, 832)    0           concatenate_15[0][0]             
__________________________________________________________________________________________________
conv2d_101 (Conv2D)             (None, 7, 7, 160)    133280      max_pooling2d_23[0][0]           
__________________________________________________________________________________________________
conv2d_103 (Conv2D)             (None, 7, 7, 32)     26656       max_pooling2d_23[0][0]           
__________________________________________________________________________________________________
max_pooling2d_24 (MaxPooling2D) (None, 7, 7, 832)    0           max_pooling2d_23[0][0]           
__________________________________________________________________________________________________
conv2d_100 (Conv2D)             (None, 7, 7, 256)    213248      max_pooling2d_23[0][0]           
__________________________________________________________________________________________________
conv2d_102 (Conv2D)             (None, 7, 7, 320)    461120      conv2d_101[0][0]                 
__________________________________________________________________________________________________
conv2d_104 (Conv2D)             (None, 7, 7, 128)    102528      conv2d_103[0][0]                 
__________________________________________________________________________________________________
conv2d_105 (Conv2D)             (None, 7, 7, 128)    106624      max_pooling2d_24[0][0]           
__________________________________________________________________________________________________
concatenate_16 (Concatenate)    (None, 7, 7, 832)    0           conv2d_100[0][0]                 
                                                                 conv2d_102[0][0]                 
                                                                 conv2d_104[0][0]                 
                                                                 conv2d_105[0][0]                 
__________________________________________________________________________________________________
conv2d_107 (Conv2D)             (None, 7, 7, 192)    159936      concatenate_16[0][0]             
__________________________________________________________________________________________________
conv2d_109 (Conv2D)             (None, 7, 7, 48)     39984       concatenate_16[0][0]             
__________________________________________________________________________________________________
max_pooling2d_25 (MaxPooling2D) (None, 7, 7, 832)    0           concatenate_16[0][0]             
__________________________________________________________________________________________________
conv2d_106 (Conv2D)             (None, 7, 7, 384)    319872      concatenate_16[0][0]             
__________________________________________________________________________________________________
conv2d_108 (Conv2D)             (None, 7, 7, 384)    663936      conv2d_107[0][0]                 
__________________________________________________________________________________________________
conv2d_110 (Conv2D)             (None, 7, 7, 128)    153728      conv2d_109[0][0]                 
__________________________________________________________________________________________________
conv2d_111 (Conv2D)             (None, 7, 7, 128)    106624      max_pooling2d_25[0][0]           
__________________________________________________________________________________________________
concatenate_17 (Concatenate)    (None, 7, 7, 1024)   0           conv2d_106[0][0]                 
                                                                 conv2d_108[0][0]                 
                                                                 conv2d_110[0][0]                 
                                                                 conv2d_111[0][0]                 
__________________________________________________________________________________________________
global_average_pooling2d_1 (Glo (None, 1024)         0           concatenate_17[0][0]             
__________________________________________________________________________________________________
dropout_1 (Dropout)             (None, 1024)         0           global_average_pooling2d_1[0][0] 
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 10)           10250       dropout_1[0][0]                  
==================================================================================================
Total params: 5,979,642
Trainable params: 5,979,642
Non-trainable params: 0
__________________________________________________________________________________________________
